{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "5",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 6,
      "content": "6",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 7,
      "content": "7",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 8,
      "content": "8",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    },
    {
      "id": 9,
      "content": "9",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "\n": 5,
      " ": 6,
      "\"": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      ":": 24,
      "a": 25,
      "e": 26,
      "m": 27,
      "n": 28,
      "o": 29,
      "p": 30,
      "r": 31,
      "s": 32,
      "t": 33,
      "w": 34,
      "{": 35,
      "}": 36,
      "\":": 37,
      "\":\"": 38,
      "\",": 39,
      "\"a": 40,
      "\"p": 41,
      "\"}": 42,
      "er": 43,
      "mp": 44,
      "ns": 45,
      "omp": 46,
      "romp": 47,
      "t\":\"": 48,
      "wer": 49,
      "{\"p": 50,
      "\",\"a": 51,
      "\"}\n": 52,
      "nswer": 53,
      "rompt\":\"": 54,
      "{\"prompt\":\"": 55,
      "\",\"answer": 56,
      "\",\"answer\":\"": 57,
      " +": 58,
      " + ": 59,
      " -": 60,
      " - ": 61,
      " *": 62,
      " * ": 63,
      "{\"prompt\":\"(": 64,
      "\",\"answer\":\"1": 65,
      "10": 66,
      "\",\"answer\":\"-": 67,
      ") - ": 68,
      ") + ": 69,
      ") * ": 70,
      "0\"}\n": 71,
      ")\",\"answer\":\"": 72,
      "4\"}\n": 73,
      "2\"}\n": 74,
      "8\"}\n": 75,
      "6\"}\n": 76,
      "5\"}\n": 77,
      "3\"}\n": 78,
      "1\"}\n": 79,
      " - (": 80,
      "7\"}\n": 81,
      "\",\"answer\":\"2": 82,
      " + (": 83,
      "9\"}\n": 84,
      "{\"prompt\":\"8": 85,
      "{\"prompt\":\"6": 86,
      "{\"prompt\":\"2": 87,
      "{\"prompt\":\"4": 88,
      "{\"prompt\":\"7": 89,
      "{\"prompt\":\"3": 90,
      "{\"prompt\":\"9": 91,
      "{\"prompt\":\"5": 92,
      " * (": 93,
      "{\"prompt\":\"1": 94,
      " * 7": 95,
      " + 5": 96,
      " - 8": 97,
      " * 2": 98,
      " + 7": 99,
      " + 4": 100,
      "\",\"answer\":\"3": 101,
      " + 8": 102,
      " + 3": 103,
      " + 6": 104,
      " + 9": 105,
      " * 9": 106,
      ")\",\"answer\":\"1": 107,
      " - 1": 108,
      " - 9": 109,
      " * 4": 110,
      "{\"prompt\":\"((": 111,
      " - 5": 112,
      " * 3": 113,
      " * 8": 114,
      " - 6": 115,
      " - 2": 116,
      " * 6": 117,
      " - 3": 118,
      " + 2": 119,
      " + 1": 120,
      " - 4": 121,
      " - 7": 122,
      " * 1": 123,
      ")\",\"answer\":\"-": 124,
      " * 5": 125,
      "\",\"answer\":\"4": 126,
      "\",\"answer\":\"5": 127,
      " * 10": 128,
      " - 10": 129,
      " + 10": 130,
      "\",\"answer\":\"6": 131,
      "\",\"answer\":\"7": 132,
      "\",\"answer\":\"8": 133,
      "{\"prompt\":\"(5": 134,
      "{\"prompt\":\"(3": 135,
      "\",\"answer\":\"9": 136,
      ")\",\"answer\":\"2": 137,
      "{\"prompt\":\"(2": 138,
      ") - (": 139,
      ") + (": 140,
      "{\"prompt\":\"(7": 141,
      "\",\"answer\":\"-1": 142,
      "{\"prompt\":\"(1": 143,
      "{\"prompt\":\"(8": 144,
      "\",\"answer\":\"10": 145,
      "{\"prompt\":\"(9": 146,
      "{\"prompt\":\"(6": 147,
      "{\"prompt\":\"(4": 148,
      ") * (": 149,
      ")\",\"answer\":\"3": 150,
      "\",\"answer\":\"12": 151,
      "\",\"answer\":\"11": 152,
      "\",\"answer\":\"-2": 153,
      "\",\"answer\":\"14": 154,
      "\",\"answer\":\"13": 155,
      "\",\"answer\":\"-3": 156,
      "\",\"answer\":\"-4": 157,
      ") - 5": 158,
      " + ((": 159,
      "00\"}\n": 160,
      ") + 4": 161,
      " - ((": 162,
      ") * 3": 163,
      ")\",\"answer\":\"4": 164,
      ")\",\"answer\":\"5": 165,
      ") - 4": 166,
      ") + 6": 167,
      ") * 4": 168,
      "\",\"answer\":\"15": 169,
      ") - 6": 170,
      ") + 2": 171,
      "100": 172,
      ") - 8": 173,
      ") * 7": 174,
      ") + 9": 175,
      ") * 6": 176,
      ") - 1": 177,
      ") - 9": 178,
      ") * 5": 179,
      ")\",\"answer\":\"6": 180,
      "80\"}\n": 181,
      ") - 7": 182,
      ") + 5": 183,
      ") + 3": 184,
      ") + 7": 185,
      ") - 3": 186,
      ") * 2": 187,
      " * ((": 188,
      ") + 8": 189,
      "\",\"answer\":\"-5": 190,
      ") * 8": 191,
      ") * 1": 192,
      ") * 9": 193,
      ") - 2": 194,
      "\",\"answer\":\"17": 195,
      ") + 1": 196,
      "20\"}\n": 197,
      "60\"}\n": 198,
      "10\"}\n": 199,
      ")\",\"answer\":\"7": 200,
      ")\",\"answer\":\"-1": 201,
      "40\"}\n": 202,
      ")\",\"answer\":\"8": 203,
      "50\"}\n": 204,
      "\",\"answer\":\"18": 205,
      "\",\"answer\":\"19": 206,
      "\",\"answer\":\"-6": 207,
      ") - 10": 208,
      ")\",\"answer\":\"-2": 209,
      "\",\"answer\":\"16": 210,
      " - (9": 211,
      "{\"prompt\":\"62": 212,
      ")\",\"answer\":\"9": 213,
      "72": 214,
      ") + 10": 215,
      "{\"prompt\":\"51": 216,
      "{\"prompt\":\"95": 217,
      "{\"prompt\":\"((4": 218,
      "{\"prompt\":\"38": 219,
      "{\"prompt\":\"93": 220,
      "{\"prompt\":\"44": 221,
      "{\"prompt\":\"71": 222,
      "44\"}\n": 223,
      "{\"prompt\":\"92": 224,
      "{\"prompt\":\"17": 225,
      ")\",\"answer\":\"11": 226,
      "{\"prompt\":\"34": 227,
      "\",\"answer\":\"-7": 228,
      "{\"prompt\":\"81": 229,
      "{\"prompt\":\"89": 230,
      "{\"prompt\":\"21": 231,
      "{\"prompt\":\"83": 232,
      "{\"prompt\":\"40": 233,
      " * (8": 234,
      ")\",\"answer\":\"-3": 235,
      "28\"}\n": 236,
      "{\"prompt\":\"36": 237,
      "40": 238,
      ") * 10": 239,
      "{\"prompt\":\"60": 240,
      "{\"prompt\":\"47": 241,
      "{\"prompt\":\"86": 242,
      "{\"prompt\":\"69": 243,
      "{\"prompt\":\"77": 244,
      "{\"prompt\":\"54": 245,
      "{\"prompt\":\"100": 246,
      " + (2": 247,
      "{\"prompt\":\"67": 248,
      "{\"prompt\":\"45": 249,
      "{\"prompt\":\"((3": 250,
      " + (6": 251,
      "{\"prompt\":\"80": 252,
      "{\"prompt\":\"87": 253,
      "{\"prompt\":\"65": 254,
      "{\"prompt\":\"23": 255,
      "{\"prompt\":\"56": 256,
      "{\"prompt\":\"11": 257,
      "48\"}\n": 258,
      "56\"}\n": 259,
      " - (2": 260,
      "{\"prompt\":\"24": 261,
      "{\"prompt\":\"28": 262,
      "{\"prompt\":\"29": 263,
      "{\"prompt\":\"72": 264,
      "{\"prompt\":\"76": 265,
      " - (5": 266,
      "{\"prompt\":\"25": 267,
      "{\"prompt\":\"55": 268,
      "19": 269,
      "36\"}\n": 270,
      "{\"prompt\":\"68": 271,
      "{\"prompt\":\"20": 272,
      "{\"prompt\":\"42": 273,
      "{\"prompt\":\"75": 274,
      "{\"prompt\":\"96": 275,
      "88\"}\n": 276,
      "{\"prompt\":\"53": 277,
      "{\"prompt\":\"58": 278,
      "{\"prompt\":\"13": 279,
      "11": 280,
      "47": 281,
      "{\"prompt\":\"10": 282,
      " - (3": 283,
      " - (6": 284,
      " + (3": 285,
      "{\"prompt\":\"64": 286,
      "{\"prompt\":\"48": 287,
      "{\"prompt\":\"35": 288,
      "{\"prompt\":\"39": 289,
      "{\"prompt\":\"59": 290,
      "{\"prompt\":\"((9": 291,
      "{\"prompt\":\"84": 292,
      "{\"prompt\":\"85": 293,
      "{\"prompt\":\"66": 294,
      "{\"prompt\":\"14": 295,
      "{\"prompt\":\"16": 296,
      "{\"prompt\":\"((2": 297,
      "04\"}\n": 298,
      "{\"prompt\":\"27": 299,
      "{\"prompt\":\"70": 300,
      "{\"prompt\":\"73": 301,
      "{\"prompt\":\"74": 302,
      "{\"prompt\":\"33": 303,
      "76": 304,
      " + (9": 305,
      "{\"prompt\":\"26": 306,
      "{\"prompt\":\"43": 307,
      "{\"prompt\":\"46": 308,
      "{\"prompt\":\"49": 309,
      "{\"prompt\":\"99": 310,
      " * (2": 311,
      " * (6": 312,
      ")\",\"answer\":\"10": 313,
      ") - ((": 314,
      "77": 315,
      " - (8": 316,
      "{\"prompt\":\"78": 317,
      "{\"prompt\":\"30": 318,
      "{\"prompt\":\"37": 319,
      "{\"prompt\":\"94": 320,
      "\",\"answer\":\"25": 321,
      "{\"prompt\":\"88": 322,
      "{\"prompt\":\"79": 323,
      "{\"prompt\":\"90": 324,
      "{\"prompt\":\"97": 325,
      "24\"}\n": 326,
      "79": 327,
      " + (5": 328,
      "{\"prompt\":\"19": 329,
      "17": 330,
      "30\"}\n": 331,
      " + (8": 332,
      "{\"prompt\":\"22": 333,
      "{\"prompt\":\"18": 334,
      "32\"}\n": 335,
      "{\"prompt\":\"98": 336,
      " * (3": 337,
      "{\"prompt\":\"12": 338,
      "{\"prompt\":\"((5": 339,
      "92\"}\n": 340,
      "{\"prompt\":\"41": 341,
      "{\"prompt\":\"31": 342,
      "{\"prompt\":\"91": 343,
      "{\"prompt\":\"50": 344,
      "{\"prompt\":\"15": 345,
      "46": 346,
      "{\"prompt\":\"61": 347,
      "{\"prompt\":\"57": 348,
      "{\"prompt\":\"((8": 349,
      "\",\"answer\":\"20": 350,
      "{\"prompt\":\"82": 351,
      "{\"prompt\":\"52": 352,
      "72\"}\n": 353,
      "\",\"answer\":\"26": 354,
      "14": 355,
      "78": 356,
      "96\"}\n": 357,
      " * (9": 358,
      "13": 359,
      "71": 360,
      "73": 361,
      " + (4": 362,
      "{\"prompt\":\"32": 363,
      ") + ((": 364,
      "25\"}\n": 365,
      "{\"prompt\":\"63": 366,
      "{\"prompt\":\"((6": 367,
      "08\"}\n": 368,
      "94\"}\n": 369,
      ") * ((": 370,
      "18": 371,
      "26\"}\n": 372,
      "52\"}\n": 373,
      " * (5": 374,
      "12\"}\n": 375,
      "16\"}\n": 376,
      "46\"}\n": 377,
      "1\",\"answer\":\"3": 378,
      "58\"}\n": 379,
      "74": 380,
      "76\"}\n": 381,
      "70\"}\n": 382,
      "90\"}\n": 383,
      ")\",\"answer\":\"13": 384,
      "4\",\"answer\":\"3": 385,
      "75": 386,
      " - (4": 387,
      ")\",\"answer\":\"16": 388,
      "6\",\"answer\":\"2": 389,
      "70": 390,
      "98\"}\n": 391,
      "16": 392,
      "13\"}\n": 393,
      "45\"}\n": 394,
      "89\"}\n": 395,
      "95\"}\n": 396,
      "2\",\"answer\":\"2": 397,
      "82\"}\n": 398,
      "86\"}\n": 399,
      "81\"}\n": 400,
      "12": 401,
      "15": 402,
      "47\"}\n": 403,
      "64\"}\n": 404,
      "7\",\"answer\":\"3": 405,
      "14\"}\n": 406,
      "22\"}\n": 407,
      "34\"}\n": 408,
      "42\"}\n": 409,
      "6\",\"answer\":\"3": 410,
      "83\"}\n": 411,
      "8\",\"answer\":\"3": 412,
      "06\"}\n": 413,
      "0\",\"answer\":\"2": 414,
      "11\"}\n": 415,
      "27\"}\n": 416,
      "54\"}\n": 417,
      "5\",\"answer\":\"2": 418,
      "68\"}\n": 419,
      "7\",\"answer\":\"4": 420,
      "6\",\"answer\":\"4": 421,
      "74\"}\n": 422,
      "7\",\"answer\":\"5": 423,
      "84\"}\n": 424,
      "8\",\"answer\":\"4": 425,
      " * (4": 426,
      "1 * 7": 427,
      "3 + 1": 428,
      "75\"}\n": 429,
      "77\"}\n": 430,
      "91\"}\n": 431,
      "{\"prompt\":\"(38": 432,
      "0\",\"answer\":\"4": 433,
      "2\",\"answer\":\"5": 434,
      "5\",\"answer\":\"5": 435,
      "78\"}\n": 436,
      "{\"prompt\":\"(55": 437,
      "0\",\"answer\":\"3": 438,
      "18\"}\n": 439,
      "1\",\"answer\":\"5": 440,
      "3 - 1": 441,
      "4\",\"answer\":\"2": 442,
      "4\",\"answer\":\"4": 443,
      "53\"}\n": 444,
      "66\"}\n": 445,
      "9\",\"answer\":\"3": 446,
      "\",\"answer\":\"72\"}\n": 447,
      "1\",\"answer\":\"2": 448,
      "41\"}\n": 449,
      "5\",\"answer\":\"6": 450,
      "67\"}\n": 451,
      "7\",\"answer\":\"2": 452,
      "8\",\"answer\":\"2": 453,
      "{\"prompt\":\"(50": 454,
      "{\"prompt\":\"(59": 455,
      "{\"prompt\":\"(30": 456,
      "{\"prompt\":\"(37": 457,
      ") - (3": 458,
      "{\"prompt\":\"(12": 459,
      "21\"}\n": 460,
      "59\"}\n": 461,
      "5\",\"answer\":\"3": 462,
      "93\"}\n": 463,
      "\",\"answer\":\"14\"}\n": 464,
      "{\"prompt\":\"(35": 465,
      "{\"prompt\":\"(39": 466,
      "{\"prompt\":\"(26": 467,
      "05\"}\n": 468,
      "19\"}\n": 469,
      "1 - 5": 470,
      "1\",\"answer\":\"4": 471,
      "23\"}\n": 472,
      "2 - 10": 473,
      "5\",\"answer\":\"4": 474,
      "73\"}\n": 475,
      "8 + 7": 476,
      "8\",\"answer\":\"6": 477,
      "97\"}\n": 478,
      "9\",\"answer\":\"4": 479,
      "\",\"answer\":\"70\"}\n": 480,
      "{\"prompt\":\"(25": 481,
      "\",\"answer\":\"124\"}\n": 482,
      "17\"}\n": 483,
      "2 - 6": 484,
      "2\",\"answer\":\"4": 485,
      "38\"}\n": 486,
      "6 * 6": 487,
      "87\"}\n": 488,
      "9\",\"answer\":\"2": 489,
      "{\"prompt\":\"(20": 490,
      ") + (9": 491,
      "{\"prompt\":\"(78": 492,
      "{\"prompt\":\"(64": 493,
      "{\"prompt\":\"(67": 494,
      "{\"prompt\":\"(49": 495,
      "15\"}\n": 496,
      "1 + 7": 497,
      "1 * 6": 498,
      "35\"}\n": 499,
      "3 * 10": 500,
      "71\"}\n": 501,
      "85\"}\n": 502,
      "\",\"answer\":\"94\"}\n": 503,
      "{\"prompt\":\"(96": 504,
      "{\"prompt\":\"(48": 505,
      "2 + 7": 506,
      "2\",\"answer\":\"6": 507,
      "3\",\"answer\":\"2": 508,
      "39\"}\n": 509,
      "3 + 7": 510,
      "49\"}\n": 511,
      "5 - 9": 512,
      "60": 513,
      "62\"}\n": 514,
      " + 47": 515,
      "1 * 4": 516,
      "1 * 10": 517,
      "1 - 10": 518,
      "20": 519,
      "29\"}\n": 520,
      "2 * 2": 521,
      "3 + 9": 522,
      "3 + 10": 523,
      "3\",\"answer\":\"7": 524,
      "4 + 5": 525,
      "4\",\"answer\":\"5": 526,
      "55\"}\n": 527,
      "51\"}\n": 528,
      "5 + 4": 529,
      "61\"}\n": 530,
      "9 + 10": 531,
      "\",\"answer\":\"18\"}\n": 532,
      "\",\"answer\":\"16\"}\n": 533,
      "\",\"answer\":\"71\"}\n": 534,
      "{\"prompt\":\"(56": 535,
      "\",\"answer\":\"97\"}\n": 536,
      "{\"prompt\":\"(16": 537,
      "{\"prompt\":\"(18": 538,
      "0\",\"answer\":\"5": 539,
      "2 + 5": 540,
      "33\"}\n": 541,
      "3 + 6": 542,
      "3 * 8": 543,
      "43\"}\n": 544,
      "4 + 7": 545,
      "7 - 1": 546,
      "8 + 9": 547,
      "9 - 2": 548,
      "\",\"answer\":\"84\"}\n": 549,
      "\",\"answer\":\"85\"}\n": 550,
      "{\"prompt\":\"(76": 551,
      "{\"prompt\":\"(87": 552,
      "1 - 3": 553,
      "1 - 7": 554,
      "2 * 7": 555,
      "2\",\"answer\":\"3": 556,
      "2 * 9": 557,
      "3 * 6": 558,
      "3\",\"answer\":\"5": 559,
      "57\"}\n": 560,
      "5 + 9": 561,
      "65\"}\n": 562,
      "69\"}\n": 563,
      "79\"}\n": 564,
      "8 + 8": 565,
      "8\",\"answer\":\"5": 566,
      "8 + 10": 567,
      "99\"}\n": 568,
      "9 - 3": 569,
      "9 + 2": 570,
      "9\",\"answer\":\"5": 571,
      "\",\"answer\":\"-10\"}\n": 572,
      " - 96": 573,
      "\",\"answer\":\"82\"}\n": 574,
      "{\"prompt\":\"(27": 575,
      ") + (3": 576,
      "\",\"answer\":\"105\"}\n": 577,
      "{\"prompt\":\"(46": 578,
      ") * (3": 579,
      "03\"}\n": 580,
      "1 * 2": 581,
      "1 * 9": 582,
      "1 - 2": 583,
      "1 * 1": 584,
      "1\",\"answer\":\"6": 585,
      "3 - 9": 586,
      "4 * 2": 587,
      "4 * 4": 588,
      "4 * 10": 589,
      "8 - 8": 590,
      "8 + 6": 591,
      "9 + 8": 592,
      "9 + 9": 593,
      "{\"prompt\":\"(100": 594,
      " - 88": 595,
      " * 26": 596,
      " + 94": 597,
      "\",\"answer\":\"88\"}\n": 598,
      "\",\"answer\":\"98\"}\n": 599,
      ") - (9": 600,
      "{\"prompt\":\"(77": 601,
      "\",\"answer\":\"-14\"}\n": 602,
      ") * (9": 603,
      "\",\"answer\":\"-44\"}\n": 604,
      "02\"}\n": 605,
      "1 - 8": 606,
      "1 + 8": 607,
      "1 - 6": 608,
      "1 * 5": 609,
      "2 - 9": 610,
      "2 * 10": 611,
      "3 * 7": 612,
      "3\",\"answer\":\"3": 613,
      "3 - 5": 614,
      "4 - 2": 615,
      "4 + 1": 616,
      "4\",\"answer\":\"6": 617,
      "5 * 1": 618,
      "5 * 10": 619,
      "8 * 7": 620,
      "9 + 3": 621,
      "9 * 8": 622,
      "\",\"answer\":\"-5\"}\n": 623,
      " - 69": 624,
      "\",\"answer\":\"74\"}\n": 625,
      "{\"prompt\":\"(57": 626,
      "\",\"answer\":\"-11\"}\n": 627,
      "{\"prompt\":\"(17": 628,
      "{\"prompt\":\"(80": 629,
      "\",\"answer\":\"100\"}\n": 630,
      "\",\"answer\":\"102\"}\n": 631,
      "\",\"answer\":\"108\"}\n": 632,
      "1 + 4": 633,
      "1 * 8": 634,
      "1 + 10": 635,
      "2 * 6": 636,
      "3 * 9": 637,
      "3 * 4": 638,
      "3 - 4": 639,
      "3\",\"answer\":\"4": 640,
      "4 + 4": 641,
      "4 * 3": 642,
      "5 * 9": 643,
      "5 - 10": 644,
      "6 + 5": 645,
      "6 + 1": 646,
      "7\",\"answer\":\"6": 647,
      "8 + 5": 648,
      "8 - 4": 649,
      "9 + 1": 650,
      "9 - 10": 651,
      "\",\"answer\":\"2\"}\n": 652,
      "\",\"answer\":\"6\"}\n": 653,
      "\",\"answer\":\"19\"}\n": 654,
      "\",\"answer\":\"-6\"}\n": 655,
      " + 70": 656,
      " - 95": 657,
      "\",\"answer\":\"89\"}\n": 658,
      "\",\"answer\":\"90\"}\n": 659,
      ") + (6": 660,
      ") + (8": 661,
      "{\"prompt\":\"(70": 662,
      "\",\"answer\":\"115\"}\n": 663,
      " + ((3": 664,
      "1 + 6": 665,
      "1 - 1": 666,
      "2 + 8": 667,
      "2 + 1": 668,
      "2\",\"answer\":\"7": 669,
      "31\"}\n": 670,
      "3 + 8": 671,
      "3 + 3": 672,
      "3 - 7": 673,
      "4 * 7": 674,
      "4 * 8": 675,
      "5 + 5": 676,
      "5 - 3": 677,
      "6 + 3": 678,
      "8 * 9": 679,
      "8\",\"answer\":\"14": 680,
      "9 * 10": 681,
      "\",\"answer\":\"7\"}\n": 682,
      "\",\"answer\":\"15\"}\n": 683,
      "\",\"answer\":\"-3\"}\n": 684,
      "\",\"answer\":\"-7\"}\n": 685,
      " + 56": 686,
      " + 75": 687,
      " - 70": 688,
      ") - (8": 689,
      ") + (5": 690,
      "\",\"answer\":\"-12\"}\n": 691,
      "\",\"answer\":\"-15\"}\n": 692,
      "{\"prompt\":\"(40": 693,
      "\",\"answer\":\"129\"}\n": 694,
      "\",\"answer\":\"117\"}\n": 695,
      "\",\"answer\":\"-21\"}\n": 696,
      "\",\"answer\":\"132\"}\n": 697,
      "\",\"answer\":\"133\"}\n": 698,
      " - ((3": 699,
      "09\"}\n": 700,
      "1 + 2": 701,
      "1 - 4": 702,
      "2 - 2": 703,
      "37\"}\n": 704,
      "3 + 4": 705,
      "4 * 9": 706,
      "4 - 4": 707,
      "4 * 1": 708,
      "5 + 6": 709,
      "5 + 1": 710,
      "6 + 9": 711,
      "6 - 2": 712,
      "6\",\"answer\":\"5": 713,
      "7 + 2": 714,
      "8 * 8": 715,
      "8 + 1": 716,
      "\",\"answer\":\"5\"}\n": 717,
      "{\"prompt\":\"(10": 718,
      "\",\"answer\":\"-2\"}\n": 719,
      " * 20": 720,
      " + 80": 721,
      " + 95": 722,
      " - 94": 723,
      "\",\"answer\":\"78\"}\n": 724,
      "\",\"answer\":\"75\"}\n": 725,
      "\",\"answer\":\"83\"}\n": 726,
      ") - (2": 727,
      ") - (4": 728,
      "{\"prompt\":\"(47": 729,
      ") * (2": 730,
      ") * (8": 731,
      "\",\"answer\":\"119\"}\n": 732,
      "1 * 3": 733,
      "2 * 4": 734,
      "2 + 2": 735,
      "200\"}\n": 736,
      "3 - 3": 737,
      "3 * 5": 738,
      "3\",\"answer\":\"8": 739,
      "4 - 1": 740,
      "4 - 9": 741,
      "4 - 3": 742,
      "4 - 10": 743,
      "5 * 7": 744,
      "5 - 8": 745,
      "5 + 8": 746,
      "5 * 4": 747,
      "63\"}\n": 748,
      "7 + 8": 749,
      "7 - 10": 750,
      "8 * 2": 751,
      "8 * 10": 752,
      "9 + 5": 753,
      "9 + 4": 754,
      "9 * 4": 755,
      "9 - 5": 756,
      "9\",\"answer\":\"6": 757,
      "\",\"answer\":\"0\"}\n": 758,
      "\",\"answer\":\"8\"}\n": 759,
      "\",\"answer\":\"3\"}\n": 760,
      "\",\"answer\":\"9\"}\n": 761,
      "\",\"answer\":\"17\"}\n": 762,
      " + 50": 763,
      " - 84": 764,
      " - 87": 765,
      " + 40": 766,
      " - 76": 767,
      " - 100": 768,
      "\",\"answer\":\"92\"}\n": 769,
      "\",\"answer\":\"96\"}\n": 770,
      ") - (5": 771,
      "\",\"answer\":\"104\"}\n": 772,
      "\",\"answer\":\"107\"}\n": 773,
      "\",\"answer\":\"109\"}\n": 774,
      "\",\"answer\":\"122\"}\n": 775,
      "\",\"answer\":\"112\"}\n": 776,
      "\",\"answer\":\"111\"}\n": 777,
      "\",\"answer\":\"-32\"}\n": 778,
      "\",\"answer\":\"-37\"}\n": 779,
      "01\"}\n": 780,
      "0 - 4": 781,
      "1 + 5": 782,
      "1 + 3": 783,
      "2 * 1": 784,
      "3 * 3": 785,
      "4 + 6": 786,
      "4 + 9": 787,
      "4 - 6": 788,
      "4 * 5": 789,
      "400\"}\n": 790,
      "5 - 6": 791,
      "5 * 6": 792,
      "6 - 5": 793,
      "6 * 8": 794,
      "6\",\"answer\":\"6": 795,
      "7 * 5": 796,
      "9 - 8": 797,
      "9 * 9": 798,
      "9 - 1": 799,
      "\",\"answer\":\"10\"}\n": 800,
      " + 76": 801,
      " + 86": 802,
      ")\",\"answer\":\"15": 803,
      " - 15": 804,
      " - 92": 805,
      " * 17": 806,
      "\",\"answer\":\"86\"}\n": 807,
      "\",\"answer\":\"91\"}\n": 808,
      "\",\"answer\":\"99\"}\n": 809,
      "\",\"answer\":\"-13\"}\n": 810,
      "\",\"answer\":\"125\"}\n": 811,
      "\",\"answer\":\"118\"}\n": 812,
      "\",\"answer\":\"-31\"}\n": 813,
      "\",\"answer\":\"-40\"}\n": 814,
      " + ((6": 815,
      "1 + 9": 816,
      "1 + 1": 817,
      "2 + 6": 818,
      "2 - 1": 819,
      "3 * 1": 820,
      "3\",\"answer\":\"14": 821,
      "4 + 3": 822,
      "4 + 2": 823,
      "4 - 7": 824,
      "5 + 10": 825,
      "6 * 2": 826,
      "6 + 4": 827,
      "8 + 4": 828,
      "8 - 1": 829,
      "8 + 2": 830,
      "9 * 2": 831,
      "9 + 6": 832,
      "9 - 4": 833,
      "\",\"answer\":\"-1\"}\n": 834,
      "\",\"answer\":\"29": 835,
      "\",\"answer\":\"28\"}\n": 836,
      ")\",\"answer\":\"19": 837,
      " - 91": 838,
      " - 97": 839,
      " - 57": 840,
      " - 77": 841,
      " + 100": 842,
      "\",\"answer\":\"77\"}\n": 843,
      "\",\"answer\":\"81\"}\n": 844,
      "\",\"answer\":\"-17\"}\n": 845,
      "\",\"answer\":\"103\"}\n": 846,
      ") * (5": 847,
      "\",\"answer\":\"114\"}\n": 848,
      "\",\"answer\":\"113\"}\n": 849,
      " + ((8": 850,
      " - ((5": 851,
      " - ((8": 852,
      "\",\"answer\":\"150\"}\n": 853,
      " * ((3": 854,
      "0 * 9": 855,
      "0 - 2": 856,
      "2 + 4": 857,
      "2 + 9": 858,
      "2 - 5": 859,
      "2 - 3": 860,
      "2 + 10": 861,
      "3 - 8": 862,
      "3 - 6": 863,
      "3\",\"answer\":\"6": 864,
      "5 + 2": 865,
      "5 - 4": 866,
      "6 + 7": 867,
      "6 + 6": 868,
      "7 + 6": 869,
      "7\",\"answer\":\"14": 870,
      "8 - 9": 871,
      "8 - 5": 872,
      "8 * 3": 873,
      "8 - 6": 874,
      "8 * 6": 875,
      "8 - 3": 876,
      "8 - 10": 877,
      "9 * 3": 878,
      "9 * 6": 879,
      "9 * 5": 880,
      "\",\"answer\":\"4\"}\n": 881,
      "\",\"answer\":\"13\"}\n": 882,
      "\",\"answer\":\"110\"}\n": 883,
      "\",\"answer\":\"-9\"}\n": 884,
      "\",\"answer\":\"25\"}\n": 885,
      " + 72": 886,
      " - 75": 887,
      "\",\"answer\":\"76\"}\n": 888,
      "\",\"answer\":\"73\"}\n": 889,
      ") + (4": 890,
      "\",\"answer\":\"-18\"}\n": 891,
      "\",\"answer\":\"-16\"}\n": 892,
      "{\"prompt\":\"(90": 893,
      "\",\"answer\":\"120\"}\n": 894,
      "\",\"answer\":\"121\"}\n": 895,
      "\",\"answer\":\"-20\"}\n": 896,
      "\",\"answer\":\"-28\"}\n": 897,
      "\",\"answer\":\"-23\"}\n": 898,
      "\",\"answer\":\"130\"}\n": 899,
      "\",\"answer\":\"135\"}\n": 900,
      "\",\"answer\":\"139\"}\n": 901,
      "\",\"answer\":\"-30\"}\n": 902,
      " + ((5": 903,
      " * ((9": 904,
      "0 + 6": 905,
      "0 * 8": 906,
      "1 - 9": 907,
      "2 - 8": 908,
      "2 * 3": 909,
      "2 * 5": 910,
      "3 + 2": 911,
      "3 - 10": 912,
      "4 - 8": 913,
      "4 * 6": 914,
      "4 + 10": 915,
      "5 * 8": 916,
      "5 - 2": 917,
      "6 - 8": 918,
      "6 * 4": 919,
      "6 - 3": 920,
      "6 * 1": 921,
      "6 - 10": 922,
      "7 - 8": 923,
      "7 + 3": 924,
      "7 - 3": 925,
      "7 * 10": 926,
      "7 + 10": 927,
      "8 * 1": 928,
      "8 * 5": 929,
      "800\"}\n": 930,
      "9 + 7": 931,
      "9 - 7": 932,
      "\",\"answer\":\"1\"}\n": 933,
      "\",\"answer\":\"-4\"}\n": 934,
      "\",\"answer\":\"23": 935,
      " + 52": 936,
      " - 85": 937,
      " + 89": 938,
      ")\",\"answer\":\"14": 939,
      " - 90": 940,
      " - 62": 941,
      " - 72": 942,
      ")\",\"answer\":\"-5": 943,
      " * 50": 944,
      "\",\"answer\":\"79\"}\n": 945,
      "\",\"answer\":\"93\"}\n": 946,
      ")\",\"answer\":\"20": 947,
      ") + (2": 948,
      ") * (4": 949,
      "\",\"answer\":\"126\"}\n": 950,
      "\",\"answer\":\"-24\"}\n": 951,
      "\",\"answer\":\"-26\"}\n": 952,
      "\",\"answer\":\"-25\"}\n": 953,
      " * ((8": 954,
      "\",\"answer\":\"-63\"}\n": 955,
      "0 + 7": 956,
      "0 + 1": 957,
      "3 - 2": 958,
      "4 + 8": 959,
      "5 * 2": 960,
      "5 - 7": 961,
      "6 * 7": 962,
      "6 - 6": 963,
      "6 + 2": 964,
      "600\"}\n": 965,
      "7 + 7": 966,
      "7 + 4": 967,
      "7 * 3": 968,
      "9 - 6": 969,
      "\",\"answer\":\"-8\"}\n": 970,
      "\",\"answer\":\"-80\"}\n": 971,
      " * 70": 972,
      " - 89": 973,
      " + 60": 974,
      " + 91": 975,
      " + 96": 976,
      ")\",\"answer\":\"100\"}\n": 977,
      " - 60": 978,
      ")\",\"answer\":\"-4": 979,
      "\",\"answer\":\"51\"}\n": 980,
      "\",\"answer\":\"80\"}\n": 981,
      "\",\"answer\":\"95\"}\n": 982,
      ")\",\"answer\":\"23": 983,
      ") - (6": 984,
      "\",\"answer\":\"-22\"}\n": 985,
      "\",\"answer\":\"143\"}\n": 986,
      "\",\"answer\":\"141\"}\n": 987,
      "\",\"answer\":\"131\"}\n": 988,
      " - ((6": 989,
      " - ((9": 990,
      "\",\"answer\":\"154\"}\n": 991,
      " * ((2": 992,
      "\",\"answer\":\"-59\"}\n": 993,
      "0 + 3": 994,
      "0 + 9": 995,
      "2 + 3": 996,
      "3 + 5": 997,
      "3 * 2": 998,
      "5 + 7": 999,
      "5 + 3": 1000,
      "5 * 3": 1001,
      "5 * 5": 1002,
      "6 * 5": 1003,
      "7 - 9": 1004,
      "7 * 1": 1005,
      "8 - 2": 1006,
      "9 * 7": 1007,
      "\",\"answer\":\"12\"}\n": 1008,
      "\",\"answer\":\"11\"}\n": 1009,
      "100\"}\n": 1010,
      " - (78": 1011,
      " - (13": 1012,
      " - 80": 1013,
      " - 86": 1014,
      "\",\"answer\":\"30": 1015,
      " + 34": 1016,
      " + 66": 1017,
      " + 99": 1018,
      ")\",\"answer\":\"12": 1019,
      " - 93": 1020,
      "{\"prompt\":\"((72": 1021,
      " * 30": 1022,
      " - 39": 1023,
      " - 71": 1024,
      " - 78": 1025,
      "\",\"answer\":\"40\"}\n": 1026,
      "\",\"answer\":\"64\"}\n": 1027,
      "\",\"answer\":\"65\"}\n": 1028,
      "\",\"answer\":\"63\"}\n": 1029,
      ")\",\"answer\":\"22": 1030,
      "\",\"answer\":\"-19\"}\n": 1031,
      "\",\"answer\":\"101\"}\n": 1032,
      ")\",\"answer\":\"30": 1033,
      "\",\"answer\":\"128\"}\n": 1034,
      "\",\"answer\":\"-29\"}\n": 1035,
      "\",\"answer\":\"145\"}\n": 1036,
      "\",\"answer\":\"136\"}\n": 1037,
      "\",\"answer\":\"-36\"}\n": 1038,
      "\",\"answer\":\"-47\"}\n": 1039,
      "\",\"answer\":\"-49\"}\n": 1040,
      "\",\"answer\":\"156\"}\n": 1041,
      "\",\"answer\":\"155\"}\n": 1042,
      ")\",\"answer\":\"62\"}\n": 1043,
      " * ((5": 1044,
      "\",\"answer\":\"179\"}\n": 1045,
      "0 - 8": 1046,
      "0 - 9": 1047,
      "0 * 1": 1048,
      "0 * 5": 1049,
      "2 * 8": 1050,
      "2 - 4": 1051,
      "2 - 7": 1052,
      "4 - 5": 1053,
      "6 - 4": 1054,
      "7 - 2": 1055,
      "7 - 7": 1056,
      "8 + 3": 1057,
      " - (46": 1058,
      "\",\"answer\":\"22\"}\n": 1059,
      " + (19": 1060,
      " - 81": 1061,
      " + 74": 1062,
      "\",\"answer\":\"38": 1063,
      " + 85": 1064,
      " + 88": 1065,
      " + 61": 1066,
      " + 64": 1067,
      " + 65": 1068,
      " * 96": 1069,
      "{\"prompt\":\"((17": 1070,
      " - 55": 1071,
      " - 58": 1072,
      " - 73": 1073,
      " - 74": 1074,
      ")\",\"answer\":\"-6": 1075,
      "\",\"answer\":\"50\"}\n": 1076,
      "\",\"answer\":\"58\"}\n": 1077,
      "\",\"answer\":\"106\"}\n": 1078,
      ") * (6": 1079,
      "\",\"answer\":\"116\"}\n": 1080,
      "\",\"answer\":\"144\"}\n": 1081,
      "\",\"answer\":\"137\"}\n": 1082,
      " + ((2": 1083,
      " - ((2": 1084,
      "\",\"answer\":\"151\"}\n": 1085,
      "\",\"answer\":\"-56\"}\n": 1086,
      "\",\"answer\":\"175\"}\n": 1087,
      "07\"}\n": 1088,
      "0 + 4": 1089,
      "0 * 3": 1090,
      "3\",\"answer\":\"18": 1091,
      "6 + 8": 1092,
      "6 - 1": 1093,
      "6 * 10": 1094,
      "6 + 10": 1095,
      "7 + 9": 1096,
      "7 * 9": 1097,
      "7 * 6": 1098,
      "9 * 1": 1099,
      "\",\"answer\":\"180\"}\n": 1100,
      "\",\"answer\":\"160\"}\n": 1101,
      "\",\"answer\":\"-8": 1102,
      "\",\"answer\":\"-10": 1103,
      "\",\"answer\":\"21\"}\n": 1104,
      " - 82": 1105,
      " - 83": 1106,
      " + 71": 1107,
      " + 78": 1108,
      " + 81": 1109,
      " + 30": 1110,
      " + 68": 1111,
      " * 97": 1112,
      ")\",\"answer\":\"1\"}\n": 1113,
      ")\",\"answer\":\"14\"}\n": 1114,
      " - 50": 1115,
      " * 87": 1116,
      " - 63": 1117,
      " - 64": 1118,
      " - 46": 1119,
      " - 79": 1120,
      "\",\"answer\":\"52\"}\n": 1121,
      "\",\"answer\":\"57\"}\n": 1122,
      "\",\"answer\":\"62\"}\n": 1123,
      "\",\"answer\":\"69\"}\n": 1124,
      "\",\"answer\":\"87\"}\n": 1125,
      ")\",\"answer\":\"32": 1126,
      ")\",\"answer\":\"39": 1127,
      "\",\"answer\":\"123\"}\n": 1128,
      "\",\"answer\":\"147\"}\n": 1129,
      "\",\"answer\":\"-34\"}\n": 1130,
      "\",\"answer\":\"-35\"}\n": 1131,
      "\",\"answer\":\"-48\"}\n": 1132,
      "\",\"answer\":\"-43\"}\n": 1133,
      " + ((4": 1134,
      " + ((9": 1135,
      "\",\"answer\":\"159\"}\n": 1136,
      " * ((6": 1137,
      "\",\"answer\":\"-50\"}\n": 1138,
      "\",\"answer\":\"-55\"}\n": 1139,
      "\",\"answer\":\"-53\"}\n": 1140,
      "\",\"answer\":\"-72\"}\n": 1141,
      "280\"}\n": 1142,
      "5 - 1": 1143,
      "5 - 5": 1144,
      "520\"}\n": 1145,
      "7 * 7": 1146,
      "7 * 8": 1147,
      "7 - 4": 1148,
      "7\",\"answer\":\"19": 1149,
      "8 * 4": 1150,
      "8 - 7": 1151,
      "880\"}\n": 1152,
      " - (11": 1153,
      " - (79": 1154,
      " - (74": 1155,
      "\",\"answer\":\"22": 1156,
      "\",\"answer\":\"27\"}\n": 1157,
      " + (47": 1158,
      " + 57": 1159,
      " + 59": 1160,
      " * 21": 1161,
      " * 24": 1162,
      "\",\"answer\":\"33": 1163,
      "\",\"answer\":\"39": 1164,
      " + 84": 1165,
      " + 36": 1166,
      " - 98": 1167,
      " - 99": 1168,
      " * 40": 1169,
      " * 44": 1170,
      "{\"prompt\":\"((76": 1171,
      " - 59": 1172,
      " - 66": 1173,
      " - 68": 1174,
      " + 20": 1175,
      " - 41": 1176,
      " * 15": 1177,
      ")\",\"answer\":\"-44\"}\n": 1178,
      "\",\"answer\":\"44\"}\n": 1179,
      "\",\"answer\":\"42\"}\n": 1180,
      "\",\"answer\":\"45\"}\n": 1181,
      "\",\"answer\":\"56\"}\n": 1182,
      "\",\"answer\":\"68": 1183,
      "\",\"answer\":\"66\"}\n": 1184,
      ")\",\"answer\":\"26\"}\n": 1185,
      "\",\"answer\":\"148\"}\n": 1186,
      "\",\"answer\":\"138\"}\n": 1187,
      "\",\"answer\":\"-38\"}\n": 1188,
      "\",\"answer\":\"-33\"}\n": 1189,
      "\",\"answer\":\"-45\"}\n": 1190,
      "\",\"answer\":\"-41\"}\n": 1191,
      ")\",\"answer\":\"58\"}\n": 1192,
      "\",\"answer\":\"174\"}\n": 1193,
      "\",\"answer\":\"164\"}\n": 1194,
      ")\",\"answer\":\"99\"}\n": 1195,
      ")\",\"answer\":\"117\"}\n": 1196,
      ") - ((3": 1197,
      "0 + 8": 1198,
      "0 * 6": 1199,
      "0 - 3": 1200,
      "0 + 10": 1201,
      "160\"}\n": 1202,
      "320\"}\n": 1203,
      "6 * 3": 1204,
      "6 - 7": 1205,
      "7 + 5": 1206,
      "9 - 9": 1207,
      "9\",\"answer\":\"8": 1208,
      ")\",\"answer\":\"80\"}\n": 1209,
      " - (40": 1210,
      " - (14": 1211,
      " * (72": 1212,
      " * (40": 1213,
      " * (77": 1214,
      " * (79": 1215,
      " - 8)\",\"answer\":\"1": 1216,
      " + 45": 1217,
      "\",\"answer\":\"36": 1218,
      " + 32": 1219,
      " + 35": 1220,
      " + 63": 1221,
      " + 93": 1222,
      ")\",\"answer\":\"18": 1223,
      "{\"prompt\":\"((13": 1224,
      "{\"prompt\":\"((74": 1225,
      " * 31": 1226,
      " * 32": 1227,
      " - 61": 1228,
      " - 29": 1229,
      " - 30": 1230,
      " + 11": 1231,
      " - 43": 1232,
      " - 47": 1233,
      " - 49": 1234,
      " * 18": 1235,
      ")\",\"answer\":\"-10": 1236,
      "\",\"answer\":\"46\"}\n": 1237,
      "\",\"answer\":\"41\"}\n": 1238,
      "\",\"answer\":\"50": 1239,
      "\",\"answer\":\"54\"}\n": 1240,
      "\",\"answer\":\"53\"}\n": 1241,
      "\",\"answer\":\"60\"}\n": 1242,
      ")\",\"answer\":\"26": 1243,
      ")\",\"answer\":\"28": 1244,
      ")\",\"answer\":\"24\"}\n": 1245,
      ")\",\"answer\":\"29\"}\n": 1246,
      ")\",\"answer\":\"34": 1247,
      "\",\"answer\":\"134\"}\n": 1248,
      "\",\"answer\":\"-42\"}\n": 1249,
      "\",\"answer\":\"-46\"}\n": 1250,
      "\",\"answer\":\"152\"}\n": 1251,
      "\",\"answer\":\"158\"}\n": 1252,
      "\",\"answer\":\"-54\"}\n": 1253,
      "\",\"answer\":\"171\"}\n": 1254,
      ")\",\"answer\":\"-17\"}\n": 1255,
      "\",\"answer\":\"-62\"}\n": 1256,
      "\",\"answer\":\"165\"}\n": 1257,
      "\",\"answer\":\"163\"}\n": 1258,
      "\",\"answer\":\"-74\"}\n": 1259,
      ")\",\"answer\":\"105\"}\n": 1260,
      ") + ((8": 1261,
      ")\",\"answer\":\"133\"}\n": 1262,
      "0 + 5": 1263,
      "150\"}\n": 1264,
      "440\"}\n": 1265,
      "5\",\"answer\":\"7": 1266,
      "500\"}\n": 1267,
      "5\",\"answer\":\"19": 1268,
      "6 * 9": 1269,
      "6 - 9": 1270,
      "7 * 4": 1271,
      "7 + 1": 1272,
      "740\"}\n": 1273,
      "9\",\"answer\":\"7": 1274,
      "\",\"answer\":\"110": 1275,
      "\",\"answer\":\"-60\"}\n": 1276,
      ")\",\"answer\":\"8\"}\n": 1277,
      " - (77": 1278,
      "\",\"answer\":\"23\"}\n": 1279,
      " + (72": 1280,
      " + (76": 1281,
      " + (79": 1282,
      " + (18": 1283,
      " + (15": 1284,
      " * (11": 1285,
      " * (47": 1286,
      " * (18": 1287,
      " * (70": 1288,
      " * (16": 1289,
      " + 54": 1290,
      " + 55": 1291,
      " + 5)\",\"answer\":\"1": 1292,
      " - 8 - 6": 1293,
      " * 28": 1294,
      " + 49": 1295,
      " + 4\",\"answer\":\"3": 1296,
      "\",\"answer\":\"35": 1297,
      " + 87": 1298,
      " + 62": 1299,
      " + 90": 1300,
      " * 90": 1301,
      ")\",\"answer\":\"13\"}\n": 1302,
      " - 11": 1303,
      " - 17": 1304,
      "{\"prompt\":\"((19": 1305,
      " - 54": 1306,
      " - 56": 1307,
      " * 3\",\"answer\":\"2": 1308,
      " * 3 * 7": 1309,
      " * 3 * 8": 1310,
      " - 65": 1311,
      " - 25": 1312,
      " - 27": 1313,
      " * 6 * 5": 1314,
      " - 32": 1315,
      " + 18": 1316,
      " - 48": 1317,
      ")\",\"answer\":\"-56\"}\n": 1318,
      "\",\"answer\":\"47\"}\n": 1319,
      " * 100": 1320,
      "\",\"answer\":\"68\"}\n": 1321,
      "\",\"answer\":\"61\"}\n": 1322,
      "\",\"answer\":\"67\"}\n": 1323,
      ")\",\"answer\":\"25": 1324,
      ")\",\"answer\":\"33": 1325,
      ")\",\"answer\":\"35\"}\n": 1326,
      "\",\"answer\":\"127\"}\n": 1327,
      ")\",\"answer\":\"40": 1328,
      ")\",\"answer\":\"44\"}\n": 1329,
      "\",\"answer\":\"153\"}\n": 1330,
      ")\",\"answer\":\"68": 1331,
      ")\",\"answer\":\"63\"}\n": 1332,
      "\",\"answer\":\"-57\"}\n": 1333,
      "\",\"answer\":\"170\"}\n": 1334,
      "\",\"answer\":\"172\"}\n": 1335,
      "\",\"answer\":\"176\"}\n": 1336,
      "\",\"answer\":\"177\"}\n": 1337,
      ")\",\"answer\":\"70\"}\n": 1338,
      ")\",\"answer\":\"85\"}\n": 1339,
      ")\",\"answer\":\"81\"}\n": 1340,
      ")\",\"answer\":\"87\"}\n": 1341,
      "\",\"answer\":\"186\"}\n": 1342,
      "\",\"answer\":\"187\"}\n": 1343,
      "\",\"answer\":\"-64\"}\n": 1344,
      "\",\"answer\":\"-66\"}\n": 1345,
      "\",\"answer\":\"-61\"}\n": 1346,
      "\",\"answer\":\"-69\"}\n": 1347,
      "\",\"answer\":\"169\"}\n": 1348,
      ")\",\"answer\":\"115\"}\n": 1349,
      ") - ((5": 1350,
      "0 - 1": 1351,
      "0 - 5": 1352,
      "0 - 10": 1353,
      "080\"}\n": 1354,
      "250\"}\n": 1355,
      "3\",\"answer\":\"10": 1356,
      "480\"}\n": 1357,
      "560\"}\n": 1358,
      "720\"}\n": 1359,
      "914\"}\n": 1360,
      "\",\"answer\":\"-81\"}\n": 1361,
      ") + 100": 1362,
      ")\",\"answer\":\"0\"}\n": 1363,
      " - (72": 1364,
      " - (19": 1365,
      " - (76": 1366,
      " - (17": 1367,
      " - (16": 1368,
      "\",\"answer\":\"24": 1369,
      "\",\"answer\":\"28": 1370,
      "\",\"answer\":\"20\"}\n": 1371,
      " + (10": 1372,
      " + (11": 1373,
      " + (77": 1374,
      " + (71": 1375,
      " * (10": 1376,
      " * (100": 1377,
      " * (17": 1378,
      " * (14": 1379,
      " * 76": 1380,
      " + 53": 1381,
      " * 22": 1382,
      " * 2 + 1": 1383,
      " * 2) - 6": 1384,
      " + 79": 1385,
      " + 41": 1386,
      " + 43": 1387,
      " + 48": 1388,
      "\",\"answer\":\"30\"}\n": 1389,
      "\",\"answer\":\"34\"}\n": 1390,
      "\",\"answer\":\"33\"}\n": 1391,
      "\",\"answer\":\"31\"}\n": 1392,
      "\",\"answer\":\"39\"}\n": 1393,
      " + 33": 1394,
      " + 37": 1395,
      " + 39": 1396,
      " + 3 * 9": 1397,
      " + 69": 1398,
      " + 6 * 7": 1399,
      " + 6 * 1": 1400,
      " + 92": 1401,
      " + 97": 1402,
      " * 91": 1403,
      ")\",\"answer\":\"11\"}\n": 1404,
      ")\",\"answer\":\"128\"}\n": 1405,
      " - 1 * 9": 1406,
      " * 4\",\"answer\":\"3": 1407,
      "{\"prompt\":\"((100": 1408,
      "{\"prompt\":\"((11": 1409,
      " * 34": 1410,
      " * 38": 1411,
      " * 3 * 4": 1412,
      " * 3 - 2": 1413,
      " * 88": 1414,
      " * 8\",\"answer\":\"4": 1415,
      " * 8) * 4": 1416,
      " - 6 + 2": 1417,
      " - 21": 1418,
      " - 28": 1419,
      " * 6) - 1": 1420,
      " + 21": 1421,
      " + 14": 1422,
      " + 16": 1423,
      " + 17": 1424,
      " - 42": 1425,
      " - 4 * 7": 1426,
      " * 12": 1427,
      ")\",\"answer\":\"-8": 1428,
      ")\",\"answer\":\"-4\"}\n": 1429,
      ")\",\"answer\":\"-6\"}\n": 1430,
      ")\",\"answer\":\"-1\"}\n": 1431,
      ")\",\"answer\":\"-10\"}\n": 1432,
      "\",\"answer\":\"40": 1433,
      "\",\"answer\":\"46": 1434,
      "\",\"answer\":\"49\"}\n": 1435,
      " - 10 + 3": 1436,
      " - 10)\",\"answer\":\"2": 1437,
      "\",\"answer\":\"90": 1438,
      ")\",\"answer\":\"20\"}\n": 1439,
      ")\",\"answer\":\"30\"}\n": 1440,
      "\",\"answer\":\"-27\"}\n": 1441,
      "\",\"answer\":\"142\"}\n": 1442,
      "\",\"answer\":\"146\"}\n": 1443,
      "\",\"answer\":\"149\"}\n": 1444,
      "\",\"answer\":\"-39\"}\n": 1445,
      ")\",\"answer\":\"42": 1446,
      ")\",\"answer\":\"40\"}\n": 1447,
      ")\",\"answer\":\"51\"}\n": 1448,
      "\",\"answer\":\"-51\"}\n": 1449,
      "\",\"answer\":\"173\"}\n": 1450,
      ")\",\"answer\":\"72\"}\n": 1451,
      ")\",\"answer\":\"94\"}\n": 1452,
      ")\",\"answer\":\"92\"}\n": 1453,
      "{\"prompt\":\"51 * 8": 1454,
      ")\",\"answer\":\"116\"}\n": 1455,
      ")\",\"answer\":\"113\"}\n": 1456,
      ")\",\"answer\":\"119\"}\n": 1457,
      ")\",\"answer\":\"-35\"}\n": 1458,
      ") + ((9": 1459,
      "184\"}\n": 1460,
      ")\",\"answer\":\"162\"}\n": 1461,
      "0 * 7": 1462,
      "0 - 7": 1463,
      "156\"}\n": 1464,
      "296\"}\n": 1465,
      "208\"}\n": 1466,
      "3\",\"answer\":\"11": 1467,
      "324\"}\n": 1468,
      "316\"}\n": 1469,
      "7 - 5": 1470,
      "780\"}\n": 1471,
      "760\"}\n": 1472,
      "888\"}\n": 1473,
      "920\"}\n": 1474,
      "904\"}\n": 1475,
      "\",\"answer\":\"-94\"}\n": 1476,
      ") - 100": 1477,
      ")\",\"answer\":\"2\"}\n": 1478,
      ")\",\"answer\":\"3\"}\n": 1479,
      " - (47": 1480,
      " - (75": 1481,
      "\",\"answer\":\"26\"}\n": 1482,
      " + (100": 1483,
      " + (13": 1484,
      " + (75": 1485,
      "{\"prompt\":\"4 * 9": 1486,
      " * (73": 1487,
      " * (12": 1488,
      "{\"prompt\":\"1 + 5": 1489,
      "{\"prompt\":\"1 + 6": 1490,
      " * 77": 1491,
      " * 7 + 5": 1492,
      " * 7 + 9": 1493,
      " + 51": 1494,
      " + 58": 1495,
      " + 5 + 4": 1496,
      " + 5 * 9": 1497,
      " + 5 - 3": 1498,
      " + 5 + 2": 1499,
      " - 8 * 8": 1500,
      " * 23": 1501,
      " * 29": 1502,
      " * 2 * 7": 1503,
      " * 2 * 6": 1504,
      " + 7 - 5": 1505,
      " + 44": 1506,
      " + 46": 1507,
      " + 4\",\"answer\":\"2": 1508,
      "\",\"answer\":\"32\"}\n": 1509,
      "\",\"answer\":\"37\"}\n": 1510,
      "\",\"answer\":\"306\"}\n": 1511,
      " + 38": 1512,
      " + 67": 1513,
      " + 6 + 3": 1514,
      " + 98": 1515,
      " + 9 + 3": 1516,
      " + 9 + 9": 1517,
      " + 9 * 8": 1518,
      " + 9 * 5": 1519,
      " * 9 - 6": 1520,
      ")\",\"answer\":\"19\"}\n": 1521,
      ")\",\"answer\":\"176": 1522,
      " - 16": 1523,
      " - 19": 1524,
      " - 1 - 5": 1525,
      " * 4 + 9": 1526,
      " * 4 + 2": 1527,
      " * 41\",\"answer\":\"3": 1528,
      " * 44\",\"answer\":\"4": 1529,
      "{\"prompt\":\"((10": 1530,
      "{\"prompt\":\"((79": 1531,
      "{\"prompt\":\"((78": 1532,
      "{\"prompt\":\"((73": 1533,
      " - 52": 1534,
      " - 5 * 9": 1535,
      " - 5 - 6": 1536,
      " * 3 + 7": 1537,
      " * 3) + 4": 1538,
      " * 38\",\"answer\":\"3": 1539,
      " * 83": 1540,
      " * 8 - 8": 1541,
      " - 2)\",\"answer\":\"6": 1542,
      " * 66": 1543,
      " * 6 - 8": 1544,
      " * 6 - 1": 1545,
      " - 31": 1546,
      " - 35": 1547,
      " - 36": 1548,
      " - 3 - 5": 1549,
      " + 22": 1550,
      " + 24": 1551,
      " + 2 * 8": 1552,
      " + 2 * 5": 1553,
      " + 13": 1554,
      " + 1 * 1": 1555,
      " - 44": 1556,
      " - 45": 1557,
      " * 16": 1558,
      " * 19": 1559,
      " * 1 + 6": 1560,
      " * 1 - 5": 1561,
      ")\",\"answer\":\"-5\"}\n": 1562,
      " * 53": 1563,
      "\",\"answer\":\"43\"}\n": 1564,
      "\",\"answer\":\"55\"}\n": 1565,
      " * 10 + 10": 1566,
      " + 10 - 6": 1567,
      " + 10 - 3": 1568,
      "\",\"answer\":\"76": 1569,
      ")\",\"answer\":\"23\"}\n": 1570,
      ") + (73": 1571,
      ") * (72": 1572,
      ")\",\"answer\":\"36": 1573,
      ")\",\"answer\":\"31\"}\n": 1574,
      "\",\"answer\":\"1260\"}\n": 1575,
      "\",\"answer\":\"140\"}\n": 1576,
      ") - 59": 1577,
      " - ((4": 1578,
      " - ((71": 1579,
      ") * 38": 1580,
      ")\",\"answer\":\"46": 1581,
      ")\",\"answer\":\"48": 1582,
      ")\",\"answer\":\"49": 1583,
      ") + 67": 1584,
      "\",\"answer\":\"157\"}\n": 1585,
      ") - 65": 1586,
      ") - 80": 1587,
      ")\",\"answer\":\"66\"}\n": 1588,
      ") - 71": 1589,
      ") - 75": 1590,
      ") - 78": 1591,
      ") * 21": 1592,
      " * ((4": 1593,
      ") + 84": 1594,
      "\",\"answer\":\"-52\"}\n": 1595,
      "\",\"answer\":\"-58\"}\n": 1596,
      ") * 8)\",\"answer\":\"5": 1597,
      ") - 24": 1598,
      ")\",\"answer\":\"70": 1599,
      ")\",\"answer\":\"74\"}\n": 1600,
      "\",\"answer\":\"182\"}\n": 1601,
      "\",\"answer\":\"185\"}\n": 1602,
      "\",\"answer\":\"189\"}\n": 1603,
      "\",\"answer\":\"194\"}\n": 1604,
      "\",\"answer\":\"192\"}\n": 1605,
      "\",\"answer\":\"193\"}\n": 1606,
      "\",\"answer\":\"-68\"}\n": 1607,
      ")\",\"answer\":\"-27\"}\n": 1608,
      "\",\"answer\":\"168\"}\n": 1609,
      "\",\"answer\":\"161\"}\n": 1610,
      "{\"prompt\":\"51 - 2": 1611,
      "{\"prompt\":\"93 - 4": 1612,
      "\",\"answer\":\"-70\"}\n": 1613,
      "\",\"answer\":\"-78\"}\n": 1614,
      "\",\"answer\":\"-73\"}\n": 1615,
      "\",\"answer\":\"-77\"}\n": 1616,
      "{\"prompt\":\"89 + 2": 1617,
      ")\",\"answer\":\"-34\"}\n": 1618,
      ")\",\"answer\":\"-38\"}\n": 1619,
      "{\"prompt\":\"36 * 8": 1620,
      "408\"}\n": 1621,
      "{\"prompt\":\"47 * 6": 1622,
      "{\"prompt\":\"54 * 4": 1623,
      "{\"prompt\":\"96 - 3": 1624,
      "470\"}\n": 1625,
      ")\",\"answer\":\"101\"}\n": 1626,
      ") - ((4": 1627,
      ") - ((8": 1628,
      "176\"}\n": 1629,
      "{\"prompt\":\"12 + 2": 1630,
      "468\"}\n": 1631,
      "\",\"answer\":\"201\"}\n": 1632,
      "784\"}\n": 1633,
      ") + ((3": 1634,
      ") * ((8": 1635,
      ") * ((9": 1636,
      ")\",\"answer\":\"161\"}\n": 1637,
      "{\"prompt\":\"(38 - 1": 1638,
      "0 - 6": 1639,
      "0\",\"answer\":\"7": 1640,
      "000\"}\n": 1641,
      "1\",\"answer\":\"8": 1642,
      "120\"}\n": 1643,
      "128\"}\n": 1644,
      "28": 1645,
      "248\"}\n": 1646,
      "288\"}\n": 1647,
      "232\"}\n": 1648,
      "264\"}\n": 1649,
      "4\",\"answer\":\"10": 1650,
      "456\"}\n": 1651,
      "5\",\"answer\":\"9": 1652,
      "510\"}\n": 1653,
      "528\"}\n": 1654,
      "640\"}\n": 1655,
      "7 - 6": 1656,
      "7\",\"answer\":\"12": 1657,
      "700\"}\n": 1658,
      "710\"}\n": 1659,
      "704\"}\n": 1660,
      "7\",\"answer\":\"25": 1661,
      "940\"}\n": 1662,
      "944\"}\n": 1663,
      "928\"}\n": 1664,
      "\",\"answer\":\"-84\"}\n": 1665,
      ")\",\"answer\":\"4\"}\n": 1666,
      " - (10": 1667,
      " - (100": 1668,
      " - (12": 1669,
      "\",\"answer\":\"24\"}\n": 1670,
      "\",\"answer\":\"220\"}\n": 1671,
      " + (40": 1672,
      " + (14": 1673,
      " + (73": 1674,
      " + (12": 1675,
      "{\"prompt\":\"7 + 3": 1676,
      " * (19": 1677,
      " * (76": 1678,
      " * (78": 1679,
      " * (71": 1680,
      " * 7 + 8": 1681,
      " * 7 * 4": 1682,
      " * 7 * 1": 1683,
      " * 7) + 9": 1684,
      " - 8 + 6": 1685,
      " - 8 - 7": 1686,
      " - 8) + 5": 1687,
      " * 2 + 5": 1688,
      " * 2 * 2": 1689,
      " * 2 - 1": 1690,
      " * 2 * 3": 1691,
      " * 2) - 1": 1692,
      " + 7 * 9": 1693,
      " + 42": 1694,
      " + 4 * 7": 1695,
      " + 4 - 9": 1696,
      " + 4)\",\"answer\":\"2": 1697,
      " + 4) * 5": 1698,
      " + 4) - 7": 1699,
      "\",\"answer\":\"36\"}\n": 1700,
      "\",\"answer\":\"324\"}\n": 1701,
      "\",\"answer\":\"325\"}\n": 1702,
      "\",\"answer\":\"353\"}\n": 1703,
      " + 82": 1704,
      " + 83": 1705,
      " + 8 * 7": 1706,
      " + 8 * 10": 1707,
      " + 8) + 9": 1708,
      " + 3 - 6": 1709,
      " + 3 - 4": 1710,
      " + 3)\",\"answer\":\"3": 1711,
      " + 3) * 2": 1712,
      " + 6)\",\"answer\":\"1": 1713,
      " + 6 - 3": 1714,
      " * 98": 1715,
      " * 99": 1716,
      " * 9 + 4": 1717,
      " * 9\",\"answer\":\"5": 1718,
      " * 9) - 8": 1719,
      ")\",\"answer\":\"12\"}\n": 1720,
      ")\",\"answer\":\"15\"}\n": 1721,
      ")\",\"answer\":\"17\"}\n": 1722,
      ")\",\"answer\":\"120\"}\n": 1723,
      ")\",\"answer\":\"148\"}\n": 1724,
      ")\",\"answer\":\"156\"}\n": 1725,
      ")\",\"answer\":\"130\"}\n": 1726,
      ")\",\"answer\":\"126\"}\n": 1727,
      ")\",\"answer\":\"145\"}\n": 1728,
      ")\",\"answer\":\"127\"}\n": 1729,
      ")\",\"answer\":\"121\"}\n": 1730,
      ")\",\"answer\":\"151\"}\n": 1731,
      " - 12": 1732,
      " - 1) + 9": 1733,
      " - 9) + (": 1734,
      " * 42": 1735,
      " * 43": 1736,
      " * 44\",\"answer\":\"3": 1737,
      " * 48\",\"answer\":\"4": 1738,
      "{\"prompt\":\"((71": 1739,
      "{\"prompt\":\"((75": 1740,
      "{\"prompt\":\"((16": 1741,
      " - 53": 1742,
      " - 5) + 2": 1743,
      " - 5) * 7": 1744,
      " * 36": 1745,
      " * 3 - 6": 1746,
      " * 3 - 4": 1747,
      " * 3) - 4": 1748,
      " * 3) * 7": 1749,
      " * 8) + 5": 1750,
      " * 8) - 3": 1751,
      " - 6 + 1": 1752,
      " - 6) - 9": 1753,
      " - 26": 1754,
      " - 2\",\"answer\":\"3": 1755,
      " - 2 + 8": 1756,
      " - 2 * 6": 1757,
      " - 2)\",\"answer\":\"3": 1758,
      " * 6 - 5": 1759,
      " * 6 * 1": 1760,
      " * 67\",\"answer\":\"5": 1761,
      " - 37": 1762,
      " - 3 * 7": 1763,
      " - 3) - 5": 1764,
      " + 23": 1765,
      " + 26": 1766,
      " + 29": 1767,
      " + 2 + 4": 1768,
      " + 2 + 8": 1769,
      " + 2) * 4": 1770,
      " + 2) * 1": 1771,
      " + 1 - 3": 1772,
      " + 1) - 1": 1773,
      " - 40": 1774,
      " - 4 * 8": 1775,
      " - 4 * 5": 1776,
